Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame Properties
The EmbeddedObjectFrame type exposes the following members.
Properties
Name | Description
Color |  Obsolete.
Line
 Gets or sets the line type of the frame.
LineType |  Obsolete.
Type
 Gets the frame type (rectangular).
Top
See Also
Reference
EmbeddedObjectFrame Class
Tekla.Structures.Drawing Namespace